# PointOnEdge Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
PointOnEdge Properties
PointOnEdge Class See Also
---
The PointOnEdge type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LocationOnCurve | The point location on curve. |

# See Also
PointOnEdge Class
Autodesk.Revit.DB Namespace